In [5]:
##Consider following code to answer further questions:
import pandas as pd
course_name = ['Data Science', 'Machine Learning' ,'Big Data', 'Data Engineer']
duration = [2,3,6,4]
df = pd.DataFrame(data = {'course_name' : course_name,'duration' : duration})

In [6]:
### Q1. Write a code to print the data present in the second row of the dataframe, 
df

        course_name  duration
0      Data Science         2
1  Machine Learning         3
2          Big Data         6
3     Data Engineer         4

In [24]:
df.loc[1]

course_name    Machine Learning
duration                      3
Name: 1, dtype: object

In [25]:
df.iloc[1]

course_name    Machine Learning
duration                      3
Name: 1, dtype: object

### Q2. What is the difference between the functions loc and iloc in pandas.DataFrame?
- iloc:
    -  Index based record will return
- loc
    - label based record will return

#### Q3. Reindex the given dataframe using a variable, reindex = [3,0,1,2] and store it in the variable, new_df then find the output for both new_df.loc[2] and new_df.iloc[2].

In [15]:
new_df=df.reindex([3,0,1,2])

In [16]:
new_df

        course_name  duration
3     Data Engineer         4
0      Data Science         2
1  Machine Learning         3
2          Big Data         6

In [17]:
new_df.loc[2]

course_name    Big Data
duration              6
Name: 2, dtype: object

In [18]:
new_df.iloc[2]

course_name    Machine Learning
duration                      3
Name: 1, dtype: object

### it will show different data 
- iloc matched with index based values 2 mean 0,1,2 , which values located in 2 index that values come
- loc macthec on index values equal to 2 so this values is come

In [26]:
import pandas as pd
import numpy as np
columns = ['column_1', 'column_2', 'column_3', 'column_4', 'column_5', 'column_6']
indices = [1,2,3,4,5,6]
#Creating a dataframe:
df1 = pd.DataFrame(np.random.rand(6,6), columns = columns, index = indices)

In [27]:
df1

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.511369  0.706470  0.023049  0.041229  0.567883  0.657837
2  0.622350  0.331277  0.984943  0.352535  0.133854  0.000180
3  0.302878  0.439233  0.981517  0.056555  0.125868  0.556510
4  0.736518  0.197609  0.780356  0.465510  0.470408  0.538117
5  0.812047  0.607042  0.174488  0.328667  0.307418  0.098702
6  0.887033  0.461153  0.588306  0.983579  0.681846  0.296357

#### Q4. Write a code to find the following statistical measurements for the above dataframe df1:
- (i) mean of each and every column present in the dataframe.
- (ii) standard deviation of column, ‘column_2’

In [38]:
df1.describe()[1:2]

      column_1  column_2  column_3  column_4  column_5  column_6
mean  0.645366   0.45713  0.588776  0.371346  0.381213  0.357951

In [39]:
df1['column_2'].std()

0.1833959810345553

#### Q5. Replace the data present in the second row of column, ‘column_2’ by a string variable then find the mean of column, column_2.

If you are getting errors in executing it then explain why.

[Hint: To replace the data use df1.loc[] and equate this to string data of your choice.]

In [30]:
## string variable not able to calculate the mean value , only numerical value only calculate the mean value

#### Q6. What do you understand about the windows function in pandas and list the types of windows functions?
- windows function are used to perform the set of calculation across of set of rows that are interrelated with current row.

In [42]:
arr=[1,2,3,4,5,6]
dfar=pd.DataFrame(arr)

In [47]:
dfar.rolling(window=2).mean()

     0
0  NaN
1  1.5
2  2.5
3  3.5
4  4.5
5  5.5

#### Q7. Write a code to print only the current month and year at the time of answering this question.

data7={'date':['2023-02-28']}

In [66]:
df7=pd.DataFrame(data7)

In [69]:
df7['year']=pd.to_datetime(df7['date']).dt.year
df7['month']=pd.to_datetime(df7['date']).dt.month

In [70]:
df7

         date  year  month
0  2023-02-28  2023      2

#### Q8. Write a Python program that takes in two dates as input (in the format YYYY-MM-DD) and calculates the difference between them in days, hours, and minutes using Pandas time delta. Theprogram should prompt the user to enter the dates and display the result.

In [77]:
fromdate=input("enter the from date")
todate= input("enter the to date")

enter the from date 2023-02-01
enter the to date 2023-02-28

In [82]:
date1=pd.to_datetime(fromdate)
date2=pd.to_datetime(todate)
datediff=date2-date1
datediff
days = datediff.days
hours = datediff.seconds // 3600
minutes = (datediff.seconds % 3600) // 60

# Display the result to the user
print(f"The difference between {date1.date()} and {date2.date()} is {days} days, {hours} hours, and {minutes} minutes.")

The difference between 2023-02-01 and 2023-02-28 is 27 days, 0 hours, and 0 minutes.

#### Q9. Write a Python program that reads a CSV file containing categorical data and converts a specifiedcolumn to a categorical data type. The program should prompt the user to enter the file path, columnname, and category order, and then display the sorted data.

In [ ]:
file_path = input("Enter the file path: ")
col_name = input("Enter the column name: ")
cat_order = input("Enter the category order (comma-separated values): ").split(",")

# Read the CSV file and convert the specified column to a categorical data type
df = pd.read_csv(file_path)
df[col_name] = pd.Categorical(df[col_name], categories=cat_order, ordered=True)

# Sort the data based on the specified column and display the result
sorted_df = df.sort_values(by=[col_name])
print(sorted_df)

In [84]:
data9={"cat":["mari","praks","queen"]}
df9=pd.DataFrame(data9)

In [85]:
df9

     cat
0   mari
1  praks
2  queen

In [87]:
df9['cat'] = pd.Categorical(df9['cat'], categories=['mari','praks'], ordered=True)

In [89]:
# Sort the data based on the specified column and display the result
sorted_df = df9.sort_values(by=['cat'])
print(sorted_df)

     cat
0   mari
1  praks
2    NaN

In [ ]:
Q10. Write a Python program that reads a CSV file containing sales data for different products and
visualizes the data using a stacked bar chart to show the sales of each product category over time. The
program should prompt the user to enter the file path and display the chart.

In [ ]:
import pandas as pd
import matplotlib.pyplot as plt

# Prompt the user to enter the file path
file_path = input("Enter the file path: ")

# Read the CSV file into a pandas DataFrame
df = pd.read_csv(file_path)

# Convert the 'Date' column to datetime format
df['Date'] = pd.to_datetime(df['Date'])

# Set the 'Date' column as the index
df.set_index('Date', inplace=True)

# Group the data by product category and resample by month
grouped = df.groupby('Product Category').resample('M')['Sales'].sum().unstack()

# Create a stacked bar chart of the sales data
ax = grouped.plot(kind='bar', stacked=True, figsize=(10,6))

# Set the title and axis labels
ax.set_title('Sales by Product Category', fontsize=16)
ax.set_xlabel('Month', fontsize=14)
ax.set_ylabel('Sales', fontsize=14)

# Display the chart
plt.show()

Q11. You are given a CSV file containing student data that includes the student ID and their test score. Write
a Python program that reads the CSV file, calculates the mean, median, and mode of the test scores, and
displays the results in a table.

In [4]:
import pandas as pd
filepath=input('enter the file path')
data=pd.read_csv(filepath)

enter the file path testscore.csv

In [ ]:
mean=data['Test Score'].mean()
print(data['Test Score'].mean())

In [ ]:
median=data['Test Score'].median()
print(data['Test Score'].median())

In [ ]:
mode=data['Test Score'].mode()
mode[0]

In [29]:
dataop={"Statistics":['mean','median','mode'],
       'value':[mean,median,mode[0]]}
data1=pd.DataFrame(dataop)
data1

  Statistics  value
0       mean   83.5
1     median   85.0
2       mode   85.0